### Heroes Of Pymoli Data Analysis
* Of the 1163 active players, the vast majority are male (84%). There also exists, a smaller, but notable proportion of female players (14%).

* Our peak age demographic falls between 20-24 (44.8%) with secondary groups falling between 15-19 (18.60%) and 25-29 (13.4%).  
-----

### Note
* Instructions have been included for each segment. You do not have to follow them exactly, but they are included to help you think through the steps.

In [1]:
# Dependencies and Setup
import pandas as pd
import numpy as np

# File to Load (Remember to Change These)
file_to_load = "Resources/purchase_data.csv"

# Read Purchasing File and store into Pandas data frame
purchase_data = pd.read_csv(file_to_load)
purchase_data.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56
2,2,Ithergue48,24,Male,92,Final Critic,4.88
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27
4,4,Iskosia90,23,Male,131,Fury,1.44

## Player Count

* Display the total number of players

In [2]:
print("Number of Players:", purchase_data["SN"].nunique())

Number of Players: 576

## Purchasing Analysis (Total)

* Run basic calculations to obtain number of unique items, average price, etc.


* Create a summary data frame to hold the results


* Optional: give the displayed data cleaner formatting


* Display the summary data frame

In [4]:
num_unique_items = purchase_data["Item ID"].nunique()
avg_price = (purchase_data["Price"].sum()/len(purchase_data["Price"]))
total_num_purchases = purchase_data["Purchase ID"].nunique()
rev = purchase_data["Price"].sum()
print("Purchasing Analysis:")
print("Number of Items:", num_unique_items)
print("Average Price:",avg_price)
print("Number of Purchases:",total_num_purchases)
print("Revenue:",rev)

Purchasing Analysis:
Number of Items: 183
Average Price: 3.0509871794871795
Number of Purchases: 780
Revenue: 2379.77

## Gender Demographics

* Percentage and Count of Male Players


* Percentage and Count of Female Players


* Percentage and Count of Other / Non-Disclosed

In [5]:
gen_percent = purchase_data.groupby(["Gender", "SN"]).count().reset_index()["Gender"].value_counts(normalize = True)
gen = purchase_data.groupby(["Gender", "SN"]).count().reset_index()["Gender"].value_counts(normalize = False)
pd.concat([gen_percent,gen], axis=1) #attempting to combine tables, it is not working *works now

                         Gender  Gender
Male                   0.840278     484
Female                 0.140625      81
Other / Non-Disclosed  0.019097      11


## Purchasing Analysis (Gender)

* Run basic calculations to obtain purchase count, avg. purchase price, avg. purchase total per person etc. by gender




* Create a summary data frame to hold the results


* Optional: give the displayed data cleaner formatting


* Display the summary data frame

In [6]:
pa_gender = purchase_data.groupby("Gender").agg(["sum", "mean", "count"])
og_metrics = pa_gender.columns.get_level_values(0)
new_metrics = pa_gender.columns.get_level_values(1)

pa_gender.columns = og_metrics + "_" + new_metrics

pa_gender = pa_gender[["Price_sum","Price_count","Price_mean"]]

pa_gender = pd.concat([pa_gender,gen], axis=1, sort=True)
pa_gender["Normlized"] = pa_gender.Price_sum/pa_gender.Gender

pa_gender

                       Price_sum  Price_count  Price_mean  Gender  Normlized
Female                    361.94          113    3.203009      81   4.468395
Male                     1967.64          652    3.017853     484   4.065372
Other / Non-Disclosed      50.19           15    3.346000      11   4.562727

## Age Demographics

* Establish bins for ages


* Categorize the existing players using the age bins. Hint: use pd.cut()


* Calculate the numbers and percentages by age group


* Create a summary data frame to hold the results


* Optional: round the percentage column to two decimal points


* Display Age Demographics Table

In [7]:
max_age = purchase_data["Age"].max() #finding out maxium age to determine reasonable bin
min_age = purchase_data["Age"].min()#finding out minimum age to determine reasonable bin
mean_age = purchase_data["Age"].mean()
in_age = purchase_data[["Age", "SN"]].drop_duplicates()
ages = [0,9.99,14.99,19.99,24.99,29.99,34.99,39.99,1000] #buckets in years of four 
age_range = ["<10", "10-14","15-19","20-24","25-29","30-34","35-39","40+"]

assert(len(ages)>len(age_range))

purchase_data["Age_Group"] = pd.cut(in_age["Age"], ages, labels=age_range)

in_age["Age_Group"] = pd.cut(in_age["Age"], ages, labels=age_range)


age_table = pd.concat([in_age.Age_Group.value_counts(normalize=True), in_age.Age_Group.value_counts()], axis=1)

age_table

# print(mean_age)
      
# max_age

       Age_Group  Age_Group
20-24   0.447917        258
15-19   0.185764        107
25-29   0.133681         77
30-34   0.090278         52
35-39   0.053819         31
10-14   0.038194         22
<10     0.029514         17
40+     0.020833         12

## Purchasing Analysis (Age)

* Bin the purchase_data data frame by age


* Run basic calculations to obtain purchase count, avg. purchase price, avg. purchase total per person etc. in the table below


* Create a summary data frame to hold the results


* Optional: give the displayed data cleaner formatting


* Display the summary data frame

In [8]:
age_metrics = purchase_data.groupby("Age_Group").agg(["sum","mean","count"])["Price"].reset_index()
# age_metrics["Avg Purchase Total"] = float(age_metrics["sum"]/age_metrics["count"])
age_metrics

  Age_Group     sum      mean  count
0       <10   57.63  3.390000     17
1     10-14   67.64  3.074545     22
2     15-19  331.88  3.101682    107
3     20-24  790.39  3.063527    258
4     25-29  223.93  2.908182     77
5     30-34  151.92  2.921538     52
6     35-39  108.81  3.510000     31
7       40+   36.45  3.037500     12

## Top Spenders

* Run basic calculations to obtain the results in the table below


* Create a summary data frame to hold the results


* Sort the total purchase value column in descending order


* Optional: give the displayed data cleaner formatting


* Display a preview of the summary data frame

In [15]:
purchase_data.groupby("SN")["Price"].agg(["sum","mean","count"]).nlargest(5,"sum").sort_values(by="sum", ascending=True).nlargest(5,"sum")

               sum      mean  count
SN
Lisosia93    18.96  3.792000      5
Idastidru52  15.45  3.862500      4
Chamjask73   13.83  4.610000      3
Iral74       13.62  3.405000      4
Iskadarya95  13.10  4.366667      3

## Most Popular Items

* Retrieve the Item ID, Item Name, and Item Price columns


* Group by Item ID and Item Name. Perform calculations to obtain purchase count, item price, and total purchase value


* Create a summary data frame to hold the results


* Sort the purchase count column in descending order


* Optional: give the displayed data cleaner formatting


* Display a preview of the summary data frame

In [14]:
purchase_data.groupby(["Item ID","Item Name"])["Price"].agg(["sum","mean","count"]).nlargest(5,"count").sort_values(by="count", ascending=True).nlargest(5,"count")

                                                        sum  mean  count
Item ID Item Name
178     Oathbreaker, Last Hope of the Breaking Storm  50.76  4.23     12
82      Nirvana                                       44.10  4.90      9
108     Extraction, Quickblade Of Trembling Hands     31.77  3.53      9
145     Fiery Glass Crusader                          41.22  4.58      9
19      Pursuit, Cudgel of Necromancy                  8.16  1.02      8

 ## Most Profitable Items

* Sort the above table by total purchase value in descending order


* Optional: give the displayed data cleaner formatting


* Display a preview of the data frame

In [11]:
purchase_data.groupby(["Item ID","Item Name"])["Price"].agg(["sum","mean","count"]).nlargest(5,"sum").sort_values(by="sum", ascending=True).nlargest(5,"sum")

                                                        sum  mean  count
Item ID Item Name
178     Oathbreaker, Last Hope of the Breaking Storm  50.76  4.23     12
82      Nirvana                                       44.10  4.90      9
145     Fiery Glass Crusader                          41.22  4.58      9
92      Final Critic                                  39.04  4.88      8
103     Singed Scalpel                                34.80  4.35      8

Final Considerations 

-Far more users are male than female 
-Age 20-24 is most marketable this data 
-Oatbreaker... is the most popular game in the bunch but its fairly evenly distributed amongst the top tites